Белгипрозем_2017/src/Catalogs/ДескрипторыДоступаОбъектов/ДескрипторыДоступаОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДескрипторыДоступаОбъектов</name>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>CatalogRef.ВидыМероприятий</types>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецОбъекта</name>
    <type>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>BusinessProcessRef.КомплексныйПроцесс</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросДеятельности</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ВопросыДеятельности</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ГрифыДоступа</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Организации</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДескрипторВладельца</name>
    <type>
      <types>CatalogRef.ДескрипторыДоступаОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПапка</name>
    <type>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>String</types>
      <types>CatalogRef.ПапкиПисем</types>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьПочты</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>Хэш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПустойДескриптор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корреспонденты</name>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступаКорреспондентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочаяГруппа</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаПрав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Право</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравоЗапрещено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/ДескрипторыДоступаОбъектов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Рассчитывает хэш-сумму объекта
// 
Функция РассчитатьХэш() Экспорт
	
	// Упорядочивание всех табличных частей
	Сравнение = Новый СравнениеЗначений;
	Корреспонденты.Сортировать("ГруппаДоступа Возр", Сравнение);
	Пользователи.Сортировать("Пользователь Возр, Ключ Возр", Сравнение);
	РабочаяГруппа.Сортировать("Участник Возр", Сравнение);
	ФизическиеЛица.Сортировать("ГруппаДоступа Возр", Сравнение);
	НастройкаПрав.Сортировать("Пользователь Возр, Право Возр", Сравнение);
	
	// Сборка хэш-строки
	ХэшСтрока = "";
	ДобавитьЗначениеКХэшСтроке(ХэшСтрока, ВидОбъекта);
	ДобавитьЗначениеКХэшСтроке(ХэшСтрока, ВладелецОбъекта);
	ДобавитьЗначениеКХэшСтроке(ХэшСтрока, ВопросДеятельности);
	ДобавитьЗначениеКХэшСтроке(ХэшСтрока, ГрифДоступа);
	ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Организация);
	ДобавитьЗначениеКХэшСтроке(ХэшСтрока, ДескрипторВладельца);
	ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Проект);
	ДобавитьЗначениеКХэшСтроке(ХэшСтрока, УчетнаяЗаписьПочты);
	
	// Добавление ТЧ Корреспонденты
	Для каждого Эл Из Корреспонденты Цикл
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.ГруппаДоступа);
	КонецЦикла;
	
	// Добавление ТЧ ФизическиеЛица
	Для каждого Эл Из ФизическиеЛица Цикл
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.ГруппаДоступа);
	КонецЦикла;
	
	// Добавление ТЧ РабочаяГруппа
	Для каждого Эл Из РабочаяГруппа Цикл
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.Участник);
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.ОсновнойОбъектАдресации);
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.ДополнительныйОбъектАдресации);
	КонецЦикла;
	
	// Добавление ТЧ Пользователи
	Для каждого Эл Из Пользователи Цикл
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.Ключ);
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.Пользователь);
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.ОсновнойОбъектАдресации);
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.ДополнительныйОбъектАдресации);
	КонецЦикла;
	
	// Добавление ТЧ НастройкаПрав
	Для каждого Эл Из НастройкаПрав Цикл
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.Пользователь);
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.Право);
		ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Эл.ПравоЗапрещено);
	КонецЦикла;
	
	// Вычисление хэш-значения
	Хэш = ДокументооборотПраваДоступаПовтИсп.ВычислитьХэшПоСтроке(ХэшСтрока);
	
КонецФункции	

// Добавляет сведения о пользователе в ТЧ Пользователи
Процедура ДобавитьПользователя(
	Ключ, 
	Пользователь, 
	ОсновнойОбъектАдресации = Неопределено, 
	ДополнительныйОбъектАдресации = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;		
		
	Строка = Пользователи.Добавить();
	Строка.Ключ = Ключ;
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи")
		Или ТипЗнч(Пользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
		
		Строка.Пользователь = Пользователь;
		
	ИначеЕсли ТипЗнч(Пользователь) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
		
		Строка.Пользователь = Пользователь;
		Строка.ОсновнойОбъектАдресации = ОсновнойОбъектАдресации;
		Строка.ДополнительныйОбъектАдресации = ДополнительныйОбъектАдресации;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Неправильный тип пользователя.'");
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьЗначениеКХэшСтроке(ХэшСтрока, Значение)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		ХэшСтрока = ХэшСтрока + Значение;
		Возврат;
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		ХэшСтрока = ХэшСтрока + Строка(Значение);
		Возврат;
	КонецЕсли;
	
	Строка = Строка(Значение.УникальныйИдентификатор());
	ХэшСтрока = ХэшСтрока + Строка + " ";
	
КонецПроцедуры	

Процедура ПриЗаписи(Отказ)
	
	// Если это очистка устаревших дескрипторов, пересчет прав не нужен
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.ДескрипторыДоступаОбъектов.РассчитатьПрава(Ссылка, Неопределено);
	
КонецПроцедуры

// Заполняет реквизит ЭтоПустойДескриптор
// 
Функция ЗаполнитьПризнакПустого() Экспорт
	
	ЭтоПустойДескриптор = 
		Не (ЗначениеЗаполнено(ВидОбъекта)
		ИЛИ ЗначениеЗаполнено(ВладелецОбъекта)
		ИЛИ ЗначениеЗаполнено(ВопросДеятельности)
		ИЛИ ЗначениеЗаполнено(ГрифДоступа)
		ИЛИ ЗначениеЗаполнено(Организация)
		ИЛИ ЗначениеЗаполнено(Проект)
		ИЛИ ЗначениеЗаполнено(УчетнаяЗаписьПочты)
		ИЛИ ЗначениеЗаполнено(ДескрипторВладельца)
		ИЛИ Корреспонденты.Количество() > 0
		ИЛИ Пользователи.Количество() > 0
		ИЛИ РабочаяГруппа.Количество() > 0
		ИЛИ ФизическиеЛица.Количество() > 0
		ИЛИ НастройкаПрав.Количество() > 0
		ИЛИ Группа = Истина
		ИЛИ ИдентификаторОбъектаМетаданных = 
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ПапкиВнутреннихДокументов")
		ИЛИ ИдентификаторОбъектаМетаданных = 
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ПапкиФайлов")
		ИЛИ ИдентификаторОбъектаМетаданных = 
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ПапкиПисем")
		ИЛИ ИдентификаторОбъектаМетаданных = 
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ПапкиМероприятий")
		ИЛИ ИдентификаторОбъектаМетаданных = 
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ПапкиФорума"));
		
КонецФункции

#КонецЕсли
